###############################################################################
# Created by write_sdc
# Mon Dec 11 18:18:04 2023
###############################################################################
current_design top_design_mux
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 50.0000 [get_ports {mux_conf_clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_clock_latency -source -min 4.6500 [get_clocks {clk}]
set_clock_latency -source -max 5.5700 [get_clocks {clk}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[0]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[0]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[10]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[10]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[11]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[11]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[12]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[12]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[13]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[13]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[14]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[14]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[15]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[15]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[16]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[16]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[17]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[17]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[18]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[18]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[19]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[19]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[1]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[1]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[20]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[20]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[21]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[21]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[22]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[22]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[23]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[23]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[24]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[24]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[25]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[25]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[26]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[26]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[27]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[27]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[28]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[28]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[29]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[29]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[2]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[2]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[30]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[30]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[31]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[31]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[3]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[3]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[4]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[4]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[5]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[5]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[6]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[6]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[7]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[7]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[8]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[8]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_oeb[9]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_oeb[9]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[0]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[0]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[10]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[10]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[11]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[11]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[12]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[12]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[13]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[13]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[14]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[14]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[15]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[15]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[16]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[16]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[17]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[17]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[18]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[18]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[19]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[19]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[1]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[1]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[20]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[20]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[21]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[21]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[22]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[22]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[23]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[23]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[24]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[24]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[25]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[25]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[26]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[26]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[27]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[27]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[28]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[28]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[29]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[29]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[2]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[2]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[30]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[30]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[31]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[31]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[3]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[3]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[4]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[4]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[5]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[5]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[6]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[6]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[7]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[7]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[8]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[8]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_out[9]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_out[9]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {i_design_reset[0]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {i_design_reset[0]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {i_design_reset[1]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {i_design_reset[1]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {i_design_reset[2]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {i_design_reset[2]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {i_design_reset[3]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {i_design_reset[3]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {i_design_reset[4]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {i_design_reset[4]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {i_design_reset[5]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {i_design_reset[5]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {i_design_reset[6]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {i_design_reset[6]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {i_design_reset[7]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {i_design_reset[7]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {i_mux_auto_reset_enb}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {i_mux_auto_reset_enb}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {i_mux_io5_reset_enb}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {i_mux_io5_reset_enb}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {i_mux_sel[0]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {i_mux_sel[0]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {i_mux_sel[1]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {i_mux_sel[1]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {i_mux_sel[2]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {i_mux_sel[2]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {i_mux_sel[3]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {i_mux_sel[3]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {i_mux_sys_reset_enb}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {i_mux_sys_reset_enb}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[0]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[0]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[10]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[10]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[11]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[11]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[12]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[12]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[13]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[13]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[14]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[14]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[15]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[15]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[16]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[16]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[17]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[17]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[18]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[18]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[19]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[19]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[1]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[1]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[20]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[20]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[21]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[21]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[22]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[22]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[23]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[23]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[24]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[24]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[25]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[25]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[26]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[26]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[27]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[27]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[28]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[28]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[29]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[29]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[2]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[2]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[30]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[30]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[31]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[31]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[32]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[32]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[33]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[33]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[34]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[34]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[35]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[35]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[36]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[36]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[37]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[37]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[3]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[3]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[4]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[4]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[5]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[5]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[6]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[6]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[7]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[7]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[8]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[8]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_in[9]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_in[9]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {la_in[0]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {la_in[0]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {la_in[10]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {la_in[10]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {la_in[11]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {la_in[11]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {la_in[12]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {la_in[12]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {la_in[13]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {la_in[13]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {la_in[14]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {la_in[14]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {la_in[15]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {la_in[15]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {la_in[1]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {la_in[1]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {la_in[2]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {la_in[2]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {la_in[3]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {la_in[3]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {la_in[4]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {la_in[4]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {la_in[5]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {la_in[5]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {la_in[6]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {la_in[6]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {la_in[7]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {la_in[7]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {la_in[8]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {la_in[8]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {la_in[9]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {la_in[9]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_oeb[0]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_oeb[0]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_oeb[10]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_oeb[10]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_oeb[11]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_oeb[11]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_oeb[12]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_oeb[12]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_oeb[1]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_oeb[1]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_oeb[2]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_oeb[2]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_oeb[3]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_oeb[3]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_oeb[4]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_oeb[4]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_oeb[5]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_oeb[5]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_oeb[6]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_oeb[6]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_oeb[7]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_oeb[7]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_oeb[8]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_oeb[8]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_oeb[9]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_oeb[9]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_out[0]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_out[0]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_out[10]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_out[10]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_out[11]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_out[11]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_out[12]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_out[12]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_out[1]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_out[1]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_out[2]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_out[2]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_out[3]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_out[3]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_out[4]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_out[4]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_out[5]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_out[5]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_out[6]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_out[6]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_out[7]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_out[7]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_out[8]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_out[8]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_out[9]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_out[9]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_o_gpout[0]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_o_gpout[0]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_o_gpout[1]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_o_gpout[1]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_o_gpout[2]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_o_gpout[2]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_o_hsync}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_o_hsync}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_o_rgb[0]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_o_rgb[0]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_o_rgb[1]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_o_rgb[1]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_o_rgb[2]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_o_rgb[2]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_o_rgb[3]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_o_rgb[3]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_o_rgb[4]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_o_rgb[4]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_o_rgb[5]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_o_rgb[5]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_o_tex_csb}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_o_tex_csb}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_o_tex_oeb0}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_o_tex_oeb0}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_o_tex_out0}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_o_tex_out0}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_o_tex_sclk}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_o_tex_sclk}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_o_vsync}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_o_vsync}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_o_gpout[0]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_o_gpout[0]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_o_gpout[1]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_o_gpout[1]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_o_gpout[2]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_o_gpout[2]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_o_hsync}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_o_hsync}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_o_rgb[0]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_o_rgb[0]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_o_rgb[1]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_o_rgb[1]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_o_rgb[2]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_o_rgb[2]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_o_rgb[3]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_o_rgb[3]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_o_rgb[4]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_o_rgb[4]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_o_rgb[5]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_o_rgb[5]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_o_tex_csb}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_o_tex_csb}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_o_tex_oeb0}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_o_tex_oeb0}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_o_tex_out0}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_o_tex_out0}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_o_tex_sclk}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_o_tex_sclk}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_o_vsync}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_o_vsync}]
set_input_delay 27.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wb_rst_i}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[0]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[0]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[10]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[10]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[11]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[11]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[12]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[12]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[13]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[13]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[14]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[14]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[15]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[15]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[16]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[16]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[17]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[17]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[18]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[18]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[19]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[19]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[1]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[1]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[20]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[20]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[21]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[21]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[22]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[22]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[23]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[23]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[24]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[24]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[25]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[25]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[26]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[26]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[27]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[27]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[28]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[28]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[29]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[29]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[2]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[2]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[30]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[30]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[31]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[31]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[32]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[32]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[33]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[33]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[34]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[34]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[35]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[35]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[36]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[36]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[37]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[37]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[3]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[3]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[4]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[4]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[5]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[5]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[6]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[6]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[7]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[7]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[8]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[8]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {diego_io_in[9]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {diego_io_in[9]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[0]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[0]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[10]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[10]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[11]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[11]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[12]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[12]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[13]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[13]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[14]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[14]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[15]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[15]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[16]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[16]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[17]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[17]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[18]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[18]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[19]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[19]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[1]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[1]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[20]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[20]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[21]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[21]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[22]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[22]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[23]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[23]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[24]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[24]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[25]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[25]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[26]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[26]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[27]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[27]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[28]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[28]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[29]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[29]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[2]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[2]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[30]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[30]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[31]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[31]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[32]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[32]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[33]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[33]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[34]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[34]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[35]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[35]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[36]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[36]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[37]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[37]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[3]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[3]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[4]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[4]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[5]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[5]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[6]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[6]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[7]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[7]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[8]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[8]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_oeb[9]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_oeb[9]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[0]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[0]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[10]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[10]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[11]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[11]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[12]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[12]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[13]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[13]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[14]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[14]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[15]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[15]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[16]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[16]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[17]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[17]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[18]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[18]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[19]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[19]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[1]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[1]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[20]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[20]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[21]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[21]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[22]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[22]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[23]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[23]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[24]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[24]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[25]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[25]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[26]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[26]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[27]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[27]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[28]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[28]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[29]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[29]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[2]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[2]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[30]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[30]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[31]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[31]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[32]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[32]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[33]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[33]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[34]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[34]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[35]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[35]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[36]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[36]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[37]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[37]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[3]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[3]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[4]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[4]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[5]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[5]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[6]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[6]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[7]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[7]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[8]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[8]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {io_out[9]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {io_out[9]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[0]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[0]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[10]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[10]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[11]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[11]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[12]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[12]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[13]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[13]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[14]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[14]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[15]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[15]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[16]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[16]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[17]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[17]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[18]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[18]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[19]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[19]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[1]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[1]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[20]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[20]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[21]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[21]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[22]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[22]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[23]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[23]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[24]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[24]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[25]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[25]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[26]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[26]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[27]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[27]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[28]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[28]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[29]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[29]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[2]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[2]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[30]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[30]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[31]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[31]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[32]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[32]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[33]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[33]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[34]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[34]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[35]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[35]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[36]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[36]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[37]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[37]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[3]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[3]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[4]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[4]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[5]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[5]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[6]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[6]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[7]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[7]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[8]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[8]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {pawel_io_in[9]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {pawel_io_in[9]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[0]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[0]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[10]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[10]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[11]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[11]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[12]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[12]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[13]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[13]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[14]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[14]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[15]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[15]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[16]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[16]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[17]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[17]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[18]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[18]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[19]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[19]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[1]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[1]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[20]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[20]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[21]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[21]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[22]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[22]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[23]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[23]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[24]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[24]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[25]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[25]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[26]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[26]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[27]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[27]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[28]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[28]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[29]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[29]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[2]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[2]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[30]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[30]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[31]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[31]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[32]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[32]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[33]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[33]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[34]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[34]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[35]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[35]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[36]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[36]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[37]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[37]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[3]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[3]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[4]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[4]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[5]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[5]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[6]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[6]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[7]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[7]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[8]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[8]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_io_in[9]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_io_in[9]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_la_in[0]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_la_in[0]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_la_in[10]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_la_in[10]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_la_in[11]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_la_in[11]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_la_in[12]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_la_in[12]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_la_in[1]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_la_in[1]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_la_in[2]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_la_in[2]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_la_in[3]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_la_in[3]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_la_in[4]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_la_in[4]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_la_in[5]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_la_in[5]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_la_in[6]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_la_in[6]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_la_in[7]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_la_in[7]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_la_in[8]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_la_in[8]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf2_la_in[9]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf2_la_in[9]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[0]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[0]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[10]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[10]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[11]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[11]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[12]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[12]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[13]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[13]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[14]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[14]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[15]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[15]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[16]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[16]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[17]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[17]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[18]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[18]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[19]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[19]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[1]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[1]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[20]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[20]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[21]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[21]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[22]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[22]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[23]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[23]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[24]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[24]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[25]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[25]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[26]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[26]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[27]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[27]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[28]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[28]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[29]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[29]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[2]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[2]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[30]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[30]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[31]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[31]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[32]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[32]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[33]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[33]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[34]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[34]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[35]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[35]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[36]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[36]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[37]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[37]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[3]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[3]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[4]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[4]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[5]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[5]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[6]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[6]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[7]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[7]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[8]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[8]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_io_in[9]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_io_in[9]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_la_in[0]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_la_in[0]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_la_in[10]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_la_in[10]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_la_in[11]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_la_in[11]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_la_in[12]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_la_in[12]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_la_in[1]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_la_in[1]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_la_in[2]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_la_in[2]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_la_in[3]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_la_in[3]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_la_in[4]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_la_in[4]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_la_in[5]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_la_in[5]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_la_in[6]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_la_in[6]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_la_in[7]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_la_in[7]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_la_in[8]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_la_in[8]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {trzf_la_in[9]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {trzf_la_in[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1900 [get_ports {diego_clk}]
set_load -pin_load 0.1900 [get_ports {diego_ena}]
set_load -pin_load 0.1900 [get_ports {diego_rst}]
set_load -pin_load 0.1900 [get_ports {pawel_clk}]
set_load -pin_load 0.1900 [get_ports {pawel_ena}]
set_load -pin_load 0.1900 [get_ports {pawel_rst}]
set_load -pin_load 0.1900 [get_ports {solos_clk}]
set_load -pin_load 0.1900 [get_ports {solos_ena}]
set_load -pin_load 0.1900 [get_ports {solos_gpio_ready}]
set_load -pin_load 0.1900 [get_ports {solos_rst}]
set_load -pin_load 0.1900 [get_ports {trzf2_clk}]
set_load -pin_load 0.1900 [get_ports {trzf2_ena}]
set_load -pin_load 0.1900 [get_ports {trzf2_rst}]
set_load -pin_load 0.1900 [get_ports {trzf_clk}]
set_load -pin_load 0.1900 [get_ports {trzf_ena}]
set_load -pin_load 0.1900 [get_ports {trzf_rst}]
set_load -pin_load 0.1900 [get_ports {uri_clk}]
set_load -pin_load 0.1900 [get_ports {uri_ena}]
set_load -pin_load 0.1900 [get_ports {uri_rst}]
set_load -pin_load 0.1900 [get_ports {vgasp_clk}]
set_load -pin_load 0.1900 [get_ports {vgasp_rst}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[37]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[36]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[35]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[34]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[33]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[32]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[31]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[30]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[29]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[28]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[27]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[26]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[25]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[24]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[23]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[22]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[21]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[20]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[19]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[18]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[17]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[16]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[15]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[14]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[13]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[12]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[11]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[10]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[9]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[8]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[7]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[6]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[5]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[4]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[3]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[2]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[1]}]
set_load -pin_load 0.1900 [get_ports {diego_io_in[0]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[37]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[36]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[35]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[34]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[33]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[32]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[31]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[30]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[29]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[28]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[27]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[26]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[25]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[24]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[23]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[22]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[21]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[20]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[19]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[18]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[17]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[16]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[15]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[14]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[13]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[12]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[11]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[10]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[9]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[8]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[7]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[6]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[5]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[4]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[3]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[2]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[1]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[0]}]
set_load -pin_load 0.1900 [get_ports {io_out[37]}]
set_load -pin_load 0.1900 [get_ports {io_out[36]}]
set_load -pin_load 0.1900 [get_ports {io_out[35]}]
set_load -pin_load 0.1900 [get_ports {io_out[34]}]
set_load -pin_load 0.1900 [get_ports {io_out[33]}]
set_load -pin_load 0.1900 [get_ports {io_out[32]}]
set_load -pin_load 0.1900 [get_ports {io_out[31]}]
set_load -pin_load 0.1900 [get_ports {io_out[30]}]
set_load -pin_load 0.1900 [get_ports {io_out[29]}]
set_load -pin_load 0.1900 [get_ports {io_out[28]}]
set_load -pin_load 0.1900 [get_ports {io_out[27]}]
set_load -pin_load 0.1900 [get_ports {io_out[26]}]
set_load -pin_load 0.1900 [get_ports {io_out[25]}]
set_load -pin_load 0.1900 [get_ports {io_out[24]}]
set_load -pin_load 0.1900 [get_ports {io_out[23]}]
set_load -pin_load 0.1900 [get_ports {io_out[22]}]
set_load -pin_load 0.1900 [get_ports {io_out[21]}]
set_load -pin_load 0.1900 [get_ports {io_out[20]}]
set_load -pin_load 0.1900 [get_ports {io_out[19]}]
set_load -pin_load 0.1900 [get_ports {io_out[18]}]
set_load -pin_load 0.1900 [get_ports {io_out[17]}]
set_load -pin_load 0.1900 [get_ports {io_out[16]}]
set_load -pin_load 0.1900 [get_ports {io_out[15]}]
set_load -pin_load 0.1900 [get_ports {io_out[14]}]
set_load -pin_load 0.1900 [get_ports {io_out[13]}]
set_load -pin_load 0.1900 [get_ports {io_out[12]}]
set_load -pin_load 0.1900 [get_ports {io_out[11]}]
set_load -pin_load 0.1900 [get_ports {io_out[10]}]
set_load -pin_load 0.1900 [get_ports {io_out[9]}]
set_load -pin_load 0.1900 [get_ports {io_out[8]}]
set_load -pin_load 0.1900 [get_ports {io_out[7]}]
set_load -pin_load 0.1900 [get_ports {io_out[6]}]
set_load -pin_load 0.1900 [get_ports {io_out[5]}]
set_load -pin_load 0.1900 [get_ports {io_out[4]}]
set_load -pin_load 0.1900 [get_ports {io_out[3]}]
set_load -pin_load 0.1900 [get_ports {io_out[2]}]
set_load -pin_load 0.1900 [get_ports {io_out[1]}]
set_load -pin_load 0.1900 [get_ports {io_out[0]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[37]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[36]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[35]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[34]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[33]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[32]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[31]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[30]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[29]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[28]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[27]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[26]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[25]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[24]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[23]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[22]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[21]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[20]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[19]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[18]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[17]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[16]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[15]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[14]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[13]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[12]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[11]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[10]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[9]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[8]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[7]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[6]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[5]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[4]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[3]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[2]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[1]}]
set_load -pin_load 0.1900 [get_ports {pawel_io_in[0]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[37]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[36]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[35]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[34]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[33]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[32]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[31]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[30]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[29]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[28]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[27]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[26]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[25]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[24]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[23]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[22]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[21]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[20]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[19]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[18]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[17]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[16]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[15]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[14]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[13]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[12]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[11]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[10]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[9]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[8]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[7]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[6]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[5]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[4]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[3]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[2]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[1]}]
set_load -pin_load 0.1900 [get_ports {solos_io_in[0]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[37]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[36]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[35]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[34]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[33]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[32]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[31]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[30]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[29]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[28]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[27]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[26]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[25]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[24]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[23]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[22]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[21]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[20]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[19]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[18]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[17]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[16]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[15]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[14]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[13]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[12]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[11]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[10]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[9]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[8]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[7]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[6]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[5]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[4]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[3]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[2]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[1]}]
set_load -pin_load 0.1900 [get_ports {trzf2_io_in[0]}]
set_load -pin_load 0.1900 [get_ports {trzf2_la_in[12]}]
set_load -pin_load 0.1900 [get_ports {trzf2_la_in[11]}]
set_load -pin_load 0.1900 [get_ports {trzf2_la_in[10]}]
set_load -pin_load 0.1900 [get_ports {trzf2_la_in[9]}]
set_load -pin_load 0.1900 [get_ports {trzf2_la_in[8]}]
set_load -pin_load 0.1900 [get_ports {trzf2_la_in[7]}]
set_load -pin_load 0.1900 [get_ports {trzf2_la_in[6]}]
set_load -pin_load 0.1900 [get_ports {trzf2_la_in[5]}]
set_load -pin_load 0.1900 [get_ports {trzf2_la_in[4]}]
set_load -pin_load 0.1900 [get_ports {trzf2_la_in[3]}]
set_load -pin_load 0.1900 [get_ports {trzf2_la_in[2]}]
set_load -pin_load 0.1900 [get_ports {trzf2_la_in[1]}]
set_load -pin_load 0.1900 [get_ports {trzf2_la_in[0]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[37]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[36]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[35]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[34]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[33]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[32]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[31]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[30]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[29]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[28]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[27]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[26]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[25]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[24]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[23]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[22]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[21]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[20]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[19]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[18]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[17]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[16]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[15]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[14]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[13]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[12]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[11]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[10]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[9]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[8]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[7]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[6]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[5]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[4]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[3]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[2]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[1]}]
set_load -pin_load 0.1900 [get_ports {trzf_io_in[0]}]
set_load -pin_load 0.1900 [get_ports {trzf_la_in[12]}]
set_load -pin_load 0.1900 [get_ports {trzf_la_in[11]}]
set_load -pin_load 0.1900 [get_ports {trzf_la_in[10]}]
set_load -pin_load 0.1900 [get_ports {trzf_la_in[9]}]
set_load -pin_load 0.1900 [get_ports {trzf_la_in[8]}]
set_load -pin_load 0.1900 [get_ports {trzf_la_in[7]}]
set_load -pin_load 0.1900 [get_ports {trzf_la_in[6]}]
set_load -pin_load 0.1900 [get_ports {trzf_la_in[5]}]
set_load -pin_load 0.1900 [get_ports {trzf_la_in[4]}]
set_load -pin_load 0.1900 [get_ports {trzf_la_in[3]}]
set_load -pin_load 0.1900 [get_ports {trzf_la_in[2]}]
set_load -pin_load 0.1900 [get_ports {trzf_la_in[1]}]
set_load -pin_load 0.1900 [get_ports {trzf_la_in[0]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[37]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[36]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[35]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[34]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[33]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[32]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[31]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[30]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[29]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[28]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[27]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[26]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[25]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[24]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[23]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[22]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[21]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[20]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[19]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[18]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[17]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[16]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[15]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[14]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[13]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[12]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[11]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[10]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[9]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[8]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[7]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[6]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[5]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[4]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[3]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[2]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[1]}]
set_load -pin_load 0.1900 [get_ports {uri_io_in[0]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[37]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[36]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[35]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[34]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[33]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[32]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[31]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[30]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[29]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[28]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[27]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[26]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[25]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[24]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[23]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[22]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[21]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[20]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[19]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[18]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[17]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[16]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[15]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[14]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[13]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[12]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[11]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[10]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[9]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[8]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[7]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[6]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[5]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[4]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[3]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[2]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[1]}]
set_load -pin_load 0.1900 [get_ports {vgasp_io_in[0]}]
set_input_transition -min 0.0700 [get_ports {i_mux_auto_reset_enb}]
set_input_transition -max 0.8600 [get_ports {i_mux_auto_reset_enb}]
set_input_transition -min 0.0700 [get_ports {i_mux_io5_reset_enb}]
set_input_transition -max 0.8600 [get_ports {i_mux_io5_reset_enb}]
set_input_transition -min 0.0700 [get_ports {i_mux_sys_reset_enb}]
set_input_transition -max 0.8600 [get_ports {i_mux_sys_reset_enb}]
set_input_transition -min 0.0700 [get_ports {mux_conf_clk}]
set_input_transition -max 0.8600 [get_ports {mux_conf_clk}]
set_input_transition -min 0.0500 [get_ports {trzf2_o_hsync}]
set_input_transition -max 0.3800 [get_ports {trzf2_o_hsync}]
set_input_transition -min 0.0500 [get_ports {trzf2_o_tex_csb}]
set_input_transition -max 0.3800 [get_ports {trzf2_o_tex_csb}]
set_input_transition -min 0.0500 [get_ports {trzf2_o_tex_oeb0}]
set_input_transition -max 0.3800 [get_ports {trzf2_o_tex_oeb0}]
set_input_transition -min 0.0500 [get_ports {trzf2_o_tex_out0}]
set_input_transition -max 0.3800 [get_ports {trzf2_o_tex_out0}]
set_input_transition -min 0.0500 [get_ports {trzf2_o_tex_sclk}]
set_input_transition -max 0.3800 [get_ports {trzf2_o_tex_sclk}]
set_input_transition -min 0.0500 [get_ports {trzf2_o_vsync}]
set_input_transition -max 0.3800 [get_ports {trzf2_o_vsync}]
set_input_transition -min 0.0500 [get_ports {trzf_o_hsync}]
set_input_transition -max 0.3800 [get_ports {trzf_o_hsync}]
set_input_transition -min 0.0500 [get_ports {trzf_o_tex_csb}]
set_input_transition -max 0.3800 [get_ports {trzf_o_tex_csb}]
set_input_transition -min 0.0500 [get_ports {trzf_o_tex_oeb0}]
set_input_transition -max 0.3800 [get_ports {trzf_o_tex_oeb0}]
set_input_transition -min 0.0500 [get_ports {trzf_o_tex_out0}]
set_input_transition -max 0.3800 [get_ports {trzf_o_tex_out0}]
set_input_transition -min 0.0500 [get_ports {trzf_o_tex_sclk}]
set_input_transition -max 0.3800 [get_ports {trzf_o_tex_sclk}]
set_input_transition -min 0.0500 [get_ports {trzf_o_vsync}]
set_input_transition -max 0.3800 [get_ports {trzf_o_vsync}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[31]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[31]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[30]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[30]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[29]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[29]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[28]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[28]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[27]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[27]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[26]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[26]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[25]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[25]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[24]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[24]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[23]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[23]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[22]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[22]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[21]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[21]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[20]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[20]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[19]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[19]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[18]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[18]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[17]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[17]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[16]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[16]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[15]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[15]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[14]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[14]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[13]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[13]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[12]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[12]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[11]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[11]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[10]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[10]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[9]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[9]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[8]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[8]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[7]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[7]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[6]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[6]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[5]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[5]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[4]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[4]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[3]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[3]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[2]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[2]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[1]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[1]}]
set_input_transition -min 0.0500 [get_ports {diego_io_oeb[0]}]
set_input_transition -max 0.3800 [get_ports {diego_io_oeb[0]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[31]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[31]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[30]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[30]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[29]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[29]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[28]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[28]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[27]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[27]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[26]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[26]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[25]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[25]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[24]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[24]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[23]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[23]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[22]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[22]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[21]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[21]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[20]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[20]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[19]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[19]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[18]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[18]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[17]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[17]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[16]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[16]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[15]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[15]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[14]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[14]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[13]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[13]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[12]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[12]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[11]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[11]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[10]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[10]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[9]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[9]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[8]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[8]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[7]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[7]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[6]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[6]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[5]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[5]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[4]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[4]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[3]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[3]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[2]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[2]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[1]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[1]}]
set_input_transition -min 0.0500 [get_ports {diego_io_out[0]}]
set_input_transition -max 0.3800 [get_ports {diego_io_out[0]}]
set_input_transition -min 0.0700 [get_ports {i_design_reset[7]}]
set_input_transition -max 0.8600 [get_ports {i_design_reset[7]}]
set_input_transition -min 0.0700 [get_ports {i_design_reset[6]}]
set_input_transition -max 0.8600 [get_ports {i_design_reset[6]}]
set_input_transition -min 0.0700 [get_ports {i_design_reset[5]}]
set_input_transition -max 0.8600 [get_ports {i_design_reset[5]}]
set_input_transition -min 0.0700 [get_ports {i_design_reset[4]}]
set_input_transition -max 0.8600 [get_ports {i_design_reset[4]}]
set_input_transition -min 0.0700 [get_ports {i_design_reset[3]}]
set_input_transition -max 0.8600 [get_ports {i_design_reset[3]}]
set_input_transition -min 0.0700 [get_ports {i_design_reset[2]}]
set_input_transition -max 0.8600 [get_ports {i_design_reset[2]}]
set_input_transition -min 0.0700 [get_ports {i_design_reset[1]}]
set_input_transition -max 0.8600 [get_ports {i_design_reset[1]}]
set_input_transition -min 0.0700 [get_ports {i_design_reset[0]}]
set_input_transition -max 0.8600 [get_ports {i_design_reset[0]}]
set_input_transition -min 0.0700 [get_ports {i_mux_sel[3]}]
set_input_transition -max 0.8600 [get_ports {i_mux_sel[3]}]
set_input_transition -min 0.0700 [get_ports {i_mux_sel[2]}]
set_input_transition -max 0.8600 [get_ports {i_mux_sel[2]}]
set_input_transition -min 0.0700 [get_ports {i_mux_sel[1]}]
set_input_transition -max 0.8600 [get_ports {i_mux_sel[1]}]
set_input_transition -min 0.0700 [get_ports {i_mux_sel[0]}]
set_input_transition -max 0.8600 [get_ports {i_mux_sel[0]}]
set_input_transition -min 0.0500 [get_ports {io_in[37]}]
set_input_transition -max 0.3800 [get_ports {io_in[37]}]
set_input_transition -min 0.0500 [get_ports {io_in[36]}]
set_input_transition -max 0.3800 [get_ports {io_in[36]}]
set_input_transition -min 0.0500 [get_ports {io_in[35]}]
set_input_transition -max 0.3800 [get_ports {io_in[35]}]
set_input_transition -min 0.0500 [get_ports {io_in[34]}]
set_input_transition -max 0.3800 [get_ports {io_in[34]}]
set_input_transition -min 0.0500 [get_ports {io_in[33]}]
set_input_transition -max 0.3800 [get_ports {io_in[33]}]
set_input_transition -min 0.0500 [get_ports {io_in[32]}]
set_input_transition -max 0.3800 [get_ports {io_in[32]}]
set_input_transition -min 0.0500 [get_ports {io_in[31]}]
set_input_transition -max 0.3800 [get_ports {io_in[31]}]
set_input_transition -min 0.0500 [get_ports {io_in[30]}]
set_input_transition -max 0.3800 [get_ports {io_in[30]}]
set_input_transition -min 0.0500 [get_ports {io_in[29]}]
set_input_transition -max 0.3800 [get_ports {io_in[29]}]
set_input_transition -min 0.0500 [get_ports {io_in[28]}]
set_input_transition -max 0.3800 [get_ports {io_in[28]}]
set_input_transition -min 0.0500 [get_ports {io_in[27]}]
set_input_transition -max 0.3800 [get_ports {io_in[27]}]
set_input_transition -min 0.0500 [get_ports {io_in[26]}]
set_input_transition -max 0.3800 [get_ports {io_in[26]}]
set_input_transition -min 0.0500 [get_ports {io_in[25]}]
set_input_transition -max 0.3800 [get_ports {io_in[25]}]
set_input_transition -min 0.0500 [get_ports {io_in[24]}]
set_input_transition -max 0.3800 [get_ports {io_in[24]}]
set_input_transition -min 0.0500 [get_ports {io_in[23]}]
set_input_transition -max 0.3800 [get_ports {io_in[23]}]
set_input_transition -min 0.0500 [get_ports {io_in[22]}]
set_input_transition -max 0.3800 [get_ports {io_in[22]}]
set_input_transition -min 0.0500 [get_ports {io_in[21]}]
set_input_transition -max 0.3800 [get_ports {io_in[21]}]
set_input_transition -min 0.0500 [get_ports {io_in[20]}]
set_input_transition -max 0.3800 [get_ports {io_in[20]}]
set_input_transition -min 0.0500 [get_ports {io_in[19]}]
set_input_transition -max 0.3800 [get_ports {io_in[19]}]
set_input_transition -min 0.0500 [get_ports {io_in[18]}]
set_input_transition -max 0.3800 [get_ports {io_in[18]}]
set_input_transition -min 0.0500 [get_ports {io_in[17]}]
set_input_transition -max 0.3800 [get_ports {io_in[17]}]
set_input_transition -min 0.0500 [get_ports {io_in[16]}]
set_input_transition -max 0.3800 [get_ports {io_in[16]}]
set_input_transition -min 0.0500 [get_ports {io_in[15]}]
set_input_transition -max 0.3800 [get_ports {io_in[15]}]
set_input_transition -min 0.0500 [get_ports {io_in[14]}]
set_input_transition -max 0.3800 [get_ports {io_in[14]}]
set_input_transition -min 0.0500 [get_ports {io_in[13]}]
set_input_transition -max 0.3800 [get_ports {io_in[13]}]
set_input_transition -min 0.0500 [get_ports {io_in[12]}]
set_input_transition -max 0.3800 [get_ports {io_in[12]}]
set_input_transition -min 0.0500 [get_ports {io_in[11]}]
set_input_transition -max 0.3800 [get_ports {io_in[11]}]
set_input_transition -min 0.0500 [get_ports {io_in[10]}]
set_input_transition -max 0.3800 [get_ports {io_in[10]}]
set_input_transition -min 0.0500 [get_ports {io_in[9]}]
set_input_transition -max 0.3800 [get_ports {io_in[9]}]
set_input_transition -min 0.0500 [get_ports {io_in[8]}]
set_input_transition -max 0.3800 [get_ports {io_in[8]}]
set_input_transition -min 0.0500 [get_ports {io_in[7]}]
set_input_transition -max 0.3800 [get_ports {io_in[7]}]
set_input_transition -min 0.0500 [get_ports {io_in[6]}]
set_input_transition -max 0.3800 [get_ports {io_in[6]}]
set_input_transition -min 0.0500 [get_ports {io_in[5]}]
set_input_transition -max 0.3800 [get_ports {io_in[5]}]
set_input_transition -min 0.0500 [get_ports {io_in[4]}]
set_input_transition -max 0.3800 [get_ports {io_in[4]}]
set_input_transition -min 0.0500 [get_ports {io_in[3]}]
set_input_transition -max 0.3800 [get_ports {io_in[3]}]
set_input_transition -min 0.0500 [get_ports {io_in[2]}]
set_input_transition -max 0.3800 [get_ports {io_in[2]}]
set_input_transition -min 0.0500 [get_ports {io_in[1]}]
set_input_transition -max 0.3800 [get_ports {io_in[1]}]
set_input_transition -min 0.0500 [get_ports {io_in[0]}]
set_input_transition -max 0.3800 [get_ports {io_in[0]}]
set_input_transition -min 0.0700 [get_ports {la_in[15]}]
set_input_transition -max 0.8600 [get_ports {la_in[15]}]
set_input_transition -min 0.0700 [get_ports {la_in[14]}]
set_input_transition -max 0.8600 [get_ports {la_in[14]}]
set_input_transition -min 0.0700 [get_ports {la_in[13]}]
set_input_transition -max 0.8600 [get_ports {la_in[13]}]
set_input_transition -min 0.0700 [get_ports {la_in[12]}]
set_input_transition -max 0.8600 [get_ports {la_in[12]}]
set_input_transition -min 0.0700 [get_ports {la_in[11]}]
set_input_transition -max 0.8600 [get_ports {la_in[11]}]
set_input_transition -min 0.0700 [get_ports {la_in[10]}]
set_input_transition -max 0.8600 [get_ports {la_in[10]}]
set_input_transition -min 0.0700 [get_ports {la_in[9]}]
set_input_transition -max 0.8600 [get_ports {la_in[9]}]
set_input_transition -min 0.0700 [get_ports {la_in[8]}]
set_input_transition -max 0.8600 [get_ports {la_in[8]}]
set_input_transition -min 0.0700 [get_ports {la_in[7]}]
set_input_transition -max 0.8600 [get_ports {la_in[7]}]
set_input_transition -min 0.0700 [get_ports {la_in[6]}]
set_input_transition -max 0.8600 [get_ports {la_in[6]}]
set_input_transition -min 0.0700 [get_ports {la_in[5]}]
set_input_transition -max 0.8600 [get_ports {la_in[5]}]
set_input_transition -min 0.0700 [get_ports {la_in[4]}]
set_input_transition -max 0.8600 [get_ports {la_in[4]}]
set_input_transition -min 0.0700 [get_ports {la_in[3]}]
set_input_transition -max 0.8600 [get_ports {la_in[3]}]
set_input_transition -min 0.0700 [get_ports {la_in[2]}]
set_input_transition -max 0.8600 [get_ports {la_in[2]}]
set_input_transition -min 0.0700 [get_ports {la_in[1]}]
set_input_transition -max 0.8600 [get_ports {la_in[1]}]
set_input_transition -min 0.0700 [get_ports {la_in[0]}]
set_input_transition -max 0.8600 [get_ports {la_in[0]}]
set_input_transition -min 0.0500 [get_ports {pawel_io_oeb[12]}]
set_input_transition -max 0.3800 [get_ports {pawel_io_oeb[12]}]
set_input_transition -min 0.0500 [get_ports {pawel_io_oeb[11]}]
set_input_transition -max 0.3800 [get_ports {pawel_io_oeb[11]}]
set_input_transition -min 0.0500 [get_ports {pawel_io_oeb[10]}]
set_input_transition -max 0.3800 [get_ports {pawel_io_oeb[10]}]
set_input_transition -min 0.0500 [get_ports {pawel_io_oeb[9]}]
set_input_transition -max 0.3800 [get_ports {pawel_io_oeb[9]}]
set_input_transition -min 0.0500 [get_ports {pawel_io_oeb[8]}]
set_input_transition -max 0.3800 [get_ports {pawel_io_oeb[8]}]
set_input_transition -min 0.0500 [get_ports {pawel_io_oeb[7]}]
set_input_transition -max 0.3800 [get_ports {pawel_io_oeb[7]}]
set_input_transition -min 0.0500 [get_ports {pawel_io_oeb[6]}]
set_input_transition -max 0.3800 [get_ports {pawel_io_oeb[6]}]
set_input_transition -min 0.0500 [get_ports {pawel_io_oeb[5]}]
set_input_transition -max 0.3800 [get_ports {pawel_io_oeb[5]}]
set_input_transition -min 0.0500 [get_ports {pawel_io_oeb[4]}]
set_input_transition -max 0.3800 [get_ports {pawel_io_oeb[4]}]
set_input_transition -min 0.0500 [get_ports {pawel_io_oeb[3]}]
set_input_transition -max 0.3800 [get_ports {pawel_io_oeb[3]}]
set_input_transition -min 0.0500 [get_ports {pawel_io_oeb[2]}]
set_input_transition -max 0.3800 [get_ports {pawel_io_oeb[2]}]
set_input_transition -min 0.0500 [get_ports {pawel_io_oeb[1]}]
set_input_transition -max 0.3800 [get_ports {pawel_io_oeb[1]}]
set_input_transition -min 0.0500 [get_ports {pawel_io_oeb[0]}]
set_input_transition -max 0.3800 [get_ports {pawel_io_oeb[0]}]
set_input_transition -min 0.0500 [get_ports {pawel_io_out[12]}]
set_input_transition -max 0.3800 [get_ports {pawel_io_out[12]}]
set_input_transition -min 0.0500 [get_ports {pawel_io_out[11]}]
set_input_transition -max 0.3800 [get_ports {pawel_io_out[11]}]
set_input_transition -min 0.0500 [get_ports {pawel_io_out[10]}]
set_input_transition -max 0.3800 [get_ports {pawel_io_out[10]}]
set_input_transition -min 0.0500 [get_ports {pawel_io_out[9]}]
set_input_transition -max 0.3800 [get_ports {pawel_io_out[9]}]
set_input_transition -min 0.0500 [get_ports {pawel_io_out[8]}]
set_input_transition -max 0.3800 [get_ports {pawel_io_out[8]}]
set_input_transition -min 0.0500 [get_ports {pawel_io_out[7]}]
set_input_transition -max 0.3800 [get_ports {pawel_io_out[7]}]
set_input_transition -min 0.0500 [get_ports {pawel_io_out[6]}]
set_input_transition -max 0.3800 [get_ports {pawel_io_out[6]}]
set_input_transition -min 0.0500 [get_ports {pawel_io_out[5]}]
set_input_transition -max 0.3800 [get_ports {pawel_io_out[5]}]
set_input_transition -min 0.0500 [get_ports {pawel_io_out[4]}]
set_input_transition -max 0.3800 [get_ports {pawel_io_out[4]}]
set_input_transition -min 0.0500 [get_ports {pawel_io_out[3]}]
set_input_transition -max 0.3800 [get_ports {pawel_io_out[3]}]
set_input_transition -min 0.0500 [get_ports {pawel_io_out[2]}]
set_input_transition -max 0.3800 [get_ports {pawel_io_out[2]}]
set_input_transition -min 0.0500 [get_ports {pawel_io_out[1]}]
set_input_transition -max 0.3800 [get_ports {pawel_io_out[1]}]
set_input_transition -min 0.0500 [get_ports {pawel_io_out[0]}]
set_input_transition -max 0.3800 [get_ports {pawel_io_out[0]}]
set_input_transition -min 0.0500 [get_ports {trzf2_o_gpout[2]}]
set_input_transition -max 0.3800 [get_ports {trzf2_o_gpout[2]}]
set_input_transition -min 0.0500 [get_ports {trzf2_o_gpout[1]}]
set_input_transition -max 0.3800 [get_ports {trzf2_o_gpout[1]}]
set_input_transition -min 0.0500 [get_ports {trzf2_o_gpout[0]}]
set_input_transition -max 0.3800 [get_ports {trzf2_o_gpout[0]}]
set_input_transition -min 0.0500 [get_ports {trzf2_o_rgb[5]}]
set_input_transition -max 0.3800 [get_ports {trzf2_o_rgb[5]}]
set_input_transition -min 0.0500 [get_ports {trzf2_o_rgb[4]}]
set_input_transition -max 0.3800 [get_ports {trzf2_o_rgb[4]}]
set_input_transition -min 0.0500 [get_ports {trzf2_o_rgb[3]}]
set_input_transition -max 0.3800 [get_ports {trzf2_o_rgb[3]}]
set_input_transition -min 0.0500 [get_ports {trzf2_o_rgb[2]}]
set_input_transition -max 0.3800 [get_ports {trzf2_o_rgb[2]}]
set_input_transition -min 0.0500 [get_ports {trzf2_o_rgb[1]}]
set_input_transition -max 0.3800 [get_ports {trzf2_o_rgb[1]}]
set_input_transition -min 0.0500 [get_ports {trzf2_o_rgb[0]}]
set_input_transition -max 0.3800 [get_ports {trzf2_o_rgb[0]}]
set_input_transition -min 0.0500 [get_ports {trzf_o_gpout[2]}]
set_input_transition -max 0.3800 [get_ports {trzf_o_gpout[2]}]
set_input_transition -min 0.0500 [get_ports {trzf_o_gpout[1]}]
set_input_transition -max 0.3800 [get_ports {trzf_o_gpout[1]}]
set_input_transition -min 0.0500 [get_ports {trzf_o_gpout[0]}]
set_input_transition -max 0.3800 [get_ports {trzf_o_gpout[0]}]
set_input_transition -min 0.0500 [get_ports {trzf_o_rgb[5]}]
set_input_transition -max 0.3800 [get_ports {trzf_o_rgb[5]}]
set_input_transition -min 0.0500 [get_ports {trzf_o_rgb[4]}]
set_input_transition -max 0.3800 [get_ports {trzf_o_rgb[4]}]
set_input_transition -min 0.0500 [get_ports {trzf_o_rgb[3]}]
set_input_transition -max 0.3800 [get_ports {trzf_o_rgb[3]}]
set_input_transition -min 0.0500 [get_ports {trzf_o_rgb[2]}]
set_input_transition -max 0.3800 [get_ports {trzf_o_rgb[2]}]
set_input_transition -min 0.0500 [get_ports {trzf_o_rgb[1]}]
set_input_transition -max 0.3800 [get_ports {trzf_o_rgb[1]}]
set_input_transition -min 0.0500 [get_ports {trzf_o_rgb[0]}]
set_input_transition -max 0.3800 [get_ports {trzf_o_rgb[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 3.0000 [current_design]
set_max_fanout 4.0000 [current_design]
