###############################################################################
# Created by write_sdc
# Sun Dec  3 09:46:17 2023
###############################################################################
current_design top_ew_algofoogle
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 44.0000 [get_ports {i_clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_clock_latency -source -min 4.6500 [get_clocks {clk}]
set_clock_latency -source -max 5.5700 [get_clocks {clk}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1900 [get_ports {o_hsync}]
set_load -pin_load 0.1900 [get_ports {o_reset}]
set_load -pin_load 0.1900 [get_ports {o_tex_csb}]
set_load -pin_load 0.1900 [get_ports {o_tex_oeb0}]
set_load -pin_load 0.1900 [get_ports {o_tex_out0}]
set_load -pin_load 0.1900 [get_ports {o_tex_sclk}]
set_load -pin_load 0.1900 [get_ports {o_vsync}]
set_load -pin_load 0.1900 [get_ports {o_gpout[5]}]
set_load -pin_load 0.1900 [get_ports {o_gpout[4]}]
set_load -pin_load 0.1900 [get_ports {o_gpout[3]}]
set_load -pin_load 0.1900 [get_ports {o_gpout[2]}]
set_load -pin_load 0.1900 [get_ports {o_gpout[1]}]
set_load -pin_load 0.1900 [get_ports {o_gpout[0]}]
set_load -pin_load 0.1900 [get_ports {o_rgb[23]}]
set_load -pin_load 0.1900 [get_ports {o_rgb[22]}]
set_load -pin_load 0.1900 [get_ports {o_rgb[21]}]
set_load -pin_load 0.1900 [get_ports {o_rgb[20]}]
set_load -pin_load 0.1900 [get_ports {o_rgb[19]}]
set_load -pin_load 0.1900 [get_ports {o_rgb[18]}]
set_load -pin_load 0.1900 [get_ports {o_rgb[17]}]
set_load -pin_load 0.1900 [get_ports {o_rgb[16]}]
set_load -pin_load 0.1900 [get_ports {o_rgb[15]}]
set_load -pin_load 0.1900 [get_ports {o_rgb[14]}]
set_load -pin_load 0.1900 [get_ports {o_rgb[13]}]
set_load -pin_load 0.1900 [get_ports {o_rgb[12]}]
set_load -pin_load 0.1900 [get_ports {o_rgb[11]}]
set_load -pin_load 0.1900 [get_ports {o_rgb[10]}]
set_load -pin_load 0.1900 [get_ports {o_rgb[9]}]
set_load -pin_load 0.1900 [get_ports {o_rgb[8]}]
set_load -pin_load 0.1900 [get_ports {o_rgb[7]}]
set_load -pin_load 0.1900 [get_ports {o_rgb[6]}]
set_load -pin_load 0.1900 [get_ports {o_rgb[5]}]
set_load -pin_load 0.1900 [get_ports {o_rgb[4]}]
set_load -pin_load 0.1900 [get_ports {o_rgb[3]}]
set_load -pin_load 0.1900 [get_ports {o_rgb[2]}]
set_load -pin_load 0.1900 [get_ports {o_rgb[1]}]
set_load -pin_load 0.1900 [get_ports {o_rgb[0]}]
set_load -pin_load 0.1900 [get_ports {ones[15]}]
set_load -pin_load 0.1900 [get_ports {ones[14]}]
set_load -pin_load 0.1900 [get_ports {ones[13]}]
set_load -pin_load 0.1900 [get_ports {ones[12]}]
set_load -pin_load 0.1900 [get_ports {ones[11]}]
set_load -pin_load 0.1900 [get_ports {ones[10]}]
set_load -pin_load 0.1900 [get_ports {ones[9]}]
set_load -pin_load 0.1900 [get_ports {ones[8]}]
set_load -pin_load 0.1900 [get_ports {ones[7]}]
set_load -pin_load 0.1900 [get_ports {ones[6]}]
set_load -pin_load 0.1900 [get_ports {ones[5]}]
set_load -pin_load 0.1900 [get_ports {ones[4]}]
set_load -pin_load 0.1900 [get_ports {ones[3]}]
set_load -pin_load 0.1900 [get_ports {ones[2]}]
set_load -pin_load 0.1900 [get_ports {ones[1]}]
set_load -pin_load 0.1900 [get_ports {ones[0]}]
set_load -pin_load 0.1900 [get_ports {zeros[15]}]
set_load -pin_load 0.1900 [get_ports {zeros[14]}]
set_load -pin_load 0.1900 [get_ports {zeros[13]}]
set_load -pin_load 0.1900 [get_ports {zeros[12]}]
set_load -pin_load 0.1900 [get_ports {zeros[11]}]
set_load -pin_load 0.1900 [get_ports {zeros[10]}]
set_load -pin_load 0.1900 [get_ports {zeros[9]}]
set_load -pin_load 0.1900 [get_ports {zeros[8]}]
set_load -pin_load 0.1900 [get_ports {zeros[7]}]
set_load -pin_load 0.1900 [get_ports {zeros[6]}]
set_load -pin_load 0.1900 [get_ports {zeros[5]}]
set_load -pin_load 0.1900 [get_ports {zeros[4]}]
set_load -pin_load 0.1900 [get_ports {zeros[3]}]
set_load -pin_load 0.1900 [get_ports {zeros[2]}]
set_load -pin_load 0.1900 [get_ports {zeros[1]}]
set_load -pin_load 0.1900 [get_ports {zeros[0]}]
set_input_transition 0.6100 [get_ports {i_clk}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 3.0000 [current_design]
set_max_fanout 4.0000 [current_design]
